export default {
  projections: {
    ГрафикE: {
      дата: {
        __caption__: 'Дата'
      },
      сотрудники: {
        __caption__: 'Сотрудники',
        фИО: {
          __caption__: 'ФИО'
        },
        должность: {
          __caption__: 'Должность'
        }
      },
      видДеятельности: {
        __caption__: 'Вид деятельности'
      },
      часы: {
        __caption__: 'Часы'
      }
    }
  },
  validations: {
    видДеятельности: {
      __caption__: 'Вид деятельности'
    },
    дата: {
      __caption__: 'Дата'
    },
    часы: {
      __caption__: 'Часы'
    },
    сотрудники: {
      __caption__: 'Сотрудники'
    },
    графикРаботы: {
      __caption__: 'графикРаботы'
    }
  }
};
