export default {
  projections: {
    НаймРаботниковE: {
      датаНайма: {
        __caption__: 'Дата найма'
      },
      iDработника: {
        __caption__: 'I dработника'
      },
      фамилия: {
        __caption__: 'Фамилия'
      },
      имя: {
        __caption__: 'Имя'
      },
      отчество: {
        __caption__: 'Отчество'
      },
      образование: {
        __caption__: 'Образование'
      },
      опытРаботы: {
        __caption__: 'Опыт работы'
      },
      договор: {
        __caption__: 'Договор'
      },
      вакансии: {
        __caption__: 'Вакансии',
        наименование: {
          __caption__: 'Наименование'
        }
      }
    },
    НаймРаботниковL: {
      датаНайма: {
        __caption__: 'Дата найма'
      },
      iDработника: {
        __caption__: 'I dработника'
      },
      фамилия: {
        __caption__: 'Фамилия'
      },
      имя: {
        __caption__: 'Имя'
      },
      отчество: {
        __caption__: 'Отчество'
      },
      образование: {
        __caption__: 'Образование'
      },
      опытРаботы: {
        __caption__: 'Опыт работы'
      },
      договор: {
        __caption__: 'Договор'
      },
      вакансии: {
        __caption__: 'Наименование',
        наименование: {
          __caption__: 'Наименование'
        }
      }
    }
  },
  validations: {
    iDработника: {
      __caption__: 'I dработника'
    },
    датаНайма: {
      __caption__: 'Дата найма'
    },
    договор: {
      __caption__: 'Договор'
    },
    имя: {
      __caption__: 'Имя'
    },
    образование: {
      __caption__: 'Образование'
    },
    опытРаботы: {
      __caption__: 'Опыт работы'
    },
    отчество: {
      __caption__: 'Отчество'
    },
    фамилия: {
      __caption__: 'Фамилия'
    },
    вакансии: {
      __caption__: 'Вакансии'
    }
  }
};
