export default {
  projections: {
    ГрафикРаботыE: {
      датаСоздания: {
        __caption__: 'Дата создания'
      },
      сотрудники: {
        __caption__: 'Сотрудники',
        фИО: {
          __caption__: 'ФИО'
        },
        должность: {
          __caption__: 'Должность'
        }
      },
      график: {
        __caption__: 'График',
        дата: {
          __caption__: 'Дата'
        },
        сотрудники: {
          __caption__: 'Сотрудники',
          фИО: {
            __caption__: 'ФИО'
          },
          должность: {
            __caption__: 'Должность'
          }
        },
        видДеятельности: {
          __caption__: 'Вид деятельности'
        },
        часы: {
          __caption__: 'Часы'
        }
      }
    },
    ГрафикРаботыL: {
      датаСоздания: {
        __caption__: 'Дата создания'
      },
      сотрудники: {
        __caption__: 'ФИО',
        фИО: {
          __caption__: 'ФИО'
        }
      }
    }
  },
  validations: {
    датаСоздания: {
      __caption__: 'Дата создания'
    },
    сотрудники: {
      __caption__: 'Сотрудники'
    },
    график: {
      __caption__: 'График'
    }
  }
};
